# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationItemFolder..::..Name Property
FabricationItemFolder Class See Also
---
The item folder's name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# See Also
FabricationItemFolder Class
Autodesk.Revit.DB Namespace